app/controllers/carts_controller.rb

INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Thu, 14 Nov 2013 21:11:31 UTC +00:00], ["updated_at", Thu, 14 Nov 2013 21:11:31 UTC +00:00]]
---
  def create
    @cart = Cart.new(params[:cart])
 @challengers = Challenger.all
    respond_to do |format|
      if @cart.save

DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 980190962]]
---
  def destroy
     @challengers = Challenger.all
    @cart = current_cart
    @cart.destroy