app/controllers/challengers_controller.rb

SELECT "challengers".* FROM "challengers"
---
  def index
       @challengers = Challenger.search(params[:search_query])

SELECT "challengers".* FROM "challengers" WHERE "challengers"."id" = ? LIMIT 1  [["id", "980190962"]]
---
  def show
    @challenger = Challenger.find(params[:id])

SELECT "challengers".* FROM "challengers" WHERE "challengers"."id" = ? LIMIT 1  [["id", "980190962"]]
---
  def edit
    @challenger = Challenger.find(params[:id])

INSERT INTO "challengers" ("caption", "colour", "created_at", "homage_url", "location", "theme", "timescale", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @challenger = current_user.challengers.new(params[:challenger])
@cart = current_cart

    respond_to do |format|
      if @challenger.save

SELECT "challengers".* FROM "challengers" WHERE "challengers"."id" = ? LIMIT 1  [["id", "980190962"]]
UPDATE "challengers" SET "title" = 'Lorem Ipsum', "caption" = 'Bowies on now!', "homage_url" = 'lorem.jpg', "colour" = 'Orange', "location" = 'Garden', "theme" = 'Weather', "timescale" = '30 minutes', "updated_at" = '2013-11-04 15:40:18.574321' WHERE "challengers"."id" = 980190962
---
  def update
    @challenger = Challenger.find(params[:id])
    @cart = current_cart

    respond_to do |format|
      if @challenger.update_attributes(params[:challenger])

SELECT "challengers".* FROM "challengers" WHERE "challengers"."id" = ? LIMIT 1  [["id", "980190962"]]
DELETE FROM "challengers" WHERE "challengers"."id" = ?  [["id", 980190962]]
---
  def destroy
    @challenger = Challenger.find(params[:id])
    @challenger.destroy