app/controllers/challenges_controller.rb

SELECT "challengers".* FROM "challengers" ORDER BY title
---
   def index
    #@order = Order.find(params[:id])
    @cart = current_cart
    @orders = Order.all(:order => "created_at", :limit => 12)

     @challengers = Challenger.search(params[:search_query])