app/controllers/line_items_controller.rb

INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Thu, 14 Nov 2013 21:11:31 UTC +00:00], ["updated_at", Thu, 14 Nov 2013 21:11:31 UTC +00:00]]
---
  def create
    @cart = current_cart
    challenger = Challenger.find(params[:challenger_id])
    @line_item = @cart.add_challenger(challenger.id)
    @line_item.challenger = challenger

    respond_to do |format|
      if @line_item.save