app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders"
---
  def index
    @challengers = Challenger.all
    @cart = current_cart
       @orders = Order.paginate page: params[:page], order: 'created_at desc',
      per_page: 10

SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT 1  [["id", "980190962"]]
---
def show
    @challengers = Challenger.all
    @cart = current_cart
    begin
    @order = Order.find(params[:id])

SELECT COUNT(*) FROM "line_items" WHERE "line_items"."cart_id" = 980190963
---
  def new
    @challengers = Challenger.all
    @cart = current_cart
    if @cart.line_items.empty?

SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT 1  [["id", "980190962"]]
---
  def edit
    @challengers = Challenger.all
    @order = Order.find(params[:id])

INSERT INTO "orders" ("created_at", "email", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Thu, 14 Nov 2013 22:12:21 UTC +00:00], ["email", "MyString"], ["name", "MyString"], ["updated_at", Thu, 14 Nov 2013 22:12:21 UTC +00:00]]
---
  def create
     @cart = current_cart
     @challengers = Challenger.all
     @order = current_user.orders.new(params[:order])

    #@order = Order.new(params[:order])
    @order.add_line_items_from_cart(current_cart)

   respond_to do |format|
      if @order.save